### Forest: Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
09:24:06.378 STDOUT terraform: data.external.sources_tar: Reading...
09:24:06.394 STDOUT terraform: data.external.sources_tar: Read complete after 0s [id=-]
09:24:06.400 STDOUT terraform: data.digitalocean_ssh_keys.keys: Reading...
09:24:06.400 STDOUT terraform: data.digitalocean_project.forest_project: Reading...
09:24:06.401 STDOUT terraform: data.local_file.sources: Reading...
09:24:06.404 STDOUT terraform: data.local_file.sources: Read complete after 0s [id=bb2ce60de490aa69cb8b8eedf17f1502220ea86d]
09:24:06.736 STDOUT terraform: data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/177786424489830231]
09:24:06.741 STDOUT terraform: digitalocean_droplet.forest: Refreshing state... [id=488312150]
09:24:07.747 STDOUT terraform: data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
09:24:07.749 STDOUT terraform: digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
09:24:08.989 STDOUT terraform: Terraform used the selected providers to generate the following execution
09:24:08.989 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
09:24:08.989 STDOUT terraform:   ~ update in-place
09:24:08.990 STDOUT terraform: -/+ destroy and then create replacement
09:24:08.990 STDOUT terraform: Terraform will perform the following actions:
09:24:08.990 STDOUT terraform:   # digitalocean_droplet.forest must be replaced
09:24:08.990 STDOUT terraform: -/+ resource "digitalocean_droplet" "forest" {
09:24:08.990 STDOUT terraform:       ~ created_at           = "2025-04-09T13:58:49Z" -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ disk                 = 200 -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ id                   = "488312150" -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ ipv4_address         = "207.154.227.3" -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ ipv4_address_private = "10.135.0.18" -> (known after apply)
09:24:08.990 STDOUT terraform:       + ipv6_address         = (known after apply)
09:24:08.990 STDOUT terraform:       ~ locked               = false -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ memory               = 16384 -> (known after apply)
09:24:08.990 STDOUT terraform:         name                 = "prod-sync-check"
09:24:08.990 STDOUT terraform:       ~ price_hourly         = 0.125 -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ price_monthly        = 84 -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ private_networking   = true -> (known after apply)
09:24:08.990 STDOUT terraform:       ~ ssh_keys             = [ # forces replacement
09:24:08.990 STDOUT terraform:           - "04:77:74:e8:81:92:9d:1e:cb:d3:5d:0d:fa:83:56:f6",
09:24:08.990 STDOUT terraform:           - "31:fd:e9:da:70:df:ef:33:af:a2:ea:a1:fd:69:a7:9d",
09:24:08.991 STDOUT terraform:           - "99:ea:ec:bf:9f:d1:b2:52:02:b2:78:a2:57:25:a0:e7",
09:24:08.991 STDOUT terraform:           - "c7:f9:b0:49:24:aa:30:36:4e:5f:d4:a3:ab:43:49:e8",
09:24:08.991 STDOUT terraform:           - "d3:6d:af:8e:a4:b9:8f:b8:38:2b:56:06:5f:38:48:a7",
09:24:08.991 STDOUT terraform:           - "fa:62:10:64:1b:77:eb:78:a5:ba:e0:86:ff:76:7e:97",
09:24:08.991 STDOUT terraform:             # (8 unchanged elements hidden)
09:24:08.991 STDOUT terraform:         ]
09:24:08.991 STDOUT terraform:       ~ status               = "active" -> (known after apply)
09:24:08.991 STDOUT terraform:         tags                 = [
09:24:08.991 STDOUT terraform:             "iac",
09:24:08.991 STDOUT terraform:             "prod",
09:24:08.991 STDOUT terraform:         ]
09:24:08.991 STDOUT terraform:       ~ urn                  = "do:droplet:488312150" -> (known after apply)
09:24:08.991 STDOUT terraform:       ~ user_data            = (sensitive value) # forces replacement
09:24:08.991 STDOUT terraform:       ~ vcpus                = 4 -> (known after apply)
09:24:08.991 STDOUT terraform:       ~ volume_ids           = [] -> (known after apply)
09:24:08.991 STDOUT terraform:       ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
09:24:08.991 STDOUT terraform:         # (8 unchanged attributes hidden)
09:24:08.991 STDOUT terraform:     }
09:24:08.991 STDOUT terraform:   # digitalocean_project_resources.connect_forest_project will be updated in-place
09:24:08.991 STDOUT terraform:   ~ resource "digitalocean_project_resources" "connect_forest_project" {
09:24:08.991 STDOUT terraform:         id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
09:24:08.992 STDOUT terraform:       ~ resources = [
09:24:08.992 STDOUT terraform:           - "do:droplet:488312150",
09:24:08.992 STDOUT terraform:         ] -> (known after apply)
09:24:08.992 STDOUT terraform:         # (1 unchanged attribute hidden)
09:24:08.992 STDOUT terraform:     }
09:24:08.992 STDOUT terraform: Plan: 1 to add, 1 to change, 1 to destroy.
09:24:08.992 STDOUT terraform: Changes to Outputs:
09:24:08.992 STDOUT terraform:   ~ ip = [
09:24:08.992 STDOUT terraform:       ~ "207.154.227.3" -> (known after apply),
09:24:08.992 STDOUT terraform:     ]
09:24:08.992 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
09:24:08.992 STDOUT terraform: Saved the plan to: ../../../../../../tfplan
09:24:08.992 STDOUT terraform: To perform exactly these actions, run the following command to apply:
09:24:08.992 STDOUT terraform:     terraform apply "../../../../../../tfplan"
```

</details>